Revit 2027 API
RibbonItemData.GetContextualHelp Method
Gets the contextual help bound with this control.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ContextualHelp GetContextualHelp()
Public Function GetContextualHelp As ContextualHelp
public:
ContextualHelp^ GetContextualHelp()
member GetContextualHelp : unit -> ContextualHelp
Return Value
ContextualHelp
The contextual help assigned to the item, or null if there is no binding assigned.
See Also
Reference
RibbonItemData Class
Autodesk.Revit.UI Namespace